In [1]:
import numpy as np
import pandas as pd

Задание 1

In [2]:
a = np. array([[1, 6],
               [2, 8],
               [3, 11],
               [3, 10],
               [1, 7]])

In [3]:
mean_a = a.mean(axis = 0)
mean_a

array([2. , 8.4])

Задание 2

In [4]:
mean_a = mean_a.reshape(1,2)

In [5]:
mean_a.shape

(1, 2)

In [6]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

Задание 3

In [7]:
#распиливаем на столбцы
[b,c] = np.hsplit(a_centered, 2)
b = b.flatten()
c = c.flatten()

In [8]:
a_centered_sp = b @ c #находим скалярное произведение
a_centered_sp

8.0

In [9]:
rows = len(a)
rows

5

In [10]:
result = a_centered_sp/(rows-1)
result

2.0

Работа с Pandas

Задание 1

In [11]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский']})

In [12]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий',
                                                           'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
        'price': [450, 300, 350, 500, 450, 370, 290]})

In [13]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [14]:
authors_price = pd.merge(authors, book, on = 'author_id')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [15]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4

In [20]:
authors_stat = authors_price.groupby('author_name').agg({'price':'max'})
authors_stat ['max_price'] = authors_price.groupby('author_name').agg({'price':'max'})
authors_stat ['min_price'] = authors_price.groupby('author_name').agg({'price':'min'})
authors_stat ['mean_price'] = authors_price.groupby('author_name').agg({'price':'mean'})
authors_stat = authors_stat.drop('price', axis = 1)

In [21]:
authors_stat

             max_price  min_price  mean_price
author_name
Островский         370        290  330.000000
Тургенев           450        300  366.666667
Чехов              500        450  475.000000